# Titanic Death Prediction
 The Titanic dataset is a comprehensive dataset that contains various features such as passenger information (e.g., name, age, gender), ticket details, cabin information, and embarkation details. The predicted variable in this dataset is the "Survived" column, which indicates whether a passenger survived the Titanic disaster (1) or not (0).

## 1. Import libraries

In [14]:
import pandas as pd
import seaborn as sns
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.simplefilter(action='ignore',category=FutureWarning)
warnings.simplefilter(action='ignore',category=UserWarning)

## 2. Import Dataset

In [15]:
df=pd.read_csv("train.csv")

## 3. Exploratory Data Analysis (EDA)

In [18]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [20]:
df.sample(8)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
653,654,1,3,"O'Leary, Miss. Hanora ""Norah""",female,NaN,0,0,330919,7.8292,NaN,Q
725,726,0,3,"Oreskovic, Mr. Luka",male,20.0,0,0,315094,8.6625,NaN,S
412,413,1,1,"Minahan, Miss. Daisy E",female,33.0,1,0,19928,90.0000,C78,Q
463,464,0,2,"Milling, Mr. Jacob Christian",male,48.0,0,0,234360,13.0000,NaN,S
267,268,1,3,"Persson, Mr. Ernst Ulrik",male,25.0,1,0,347083,7.7750,NaN,S
141,142,1,3,"Nysten, Miss. Anna Sofia",female,22.0,0,0,347081,7.7500,NaN,S
207,208,1,3,"Albimona, Mr. Nassef Cassem",male,26.0,0,0,2699,18.7875,NaN,C
713,714,0,3,"Larsson, Mr. August Viktor",male,29.0,0,0,7545,9.4833,NaN,S

In [4]:
df.drop(['PassengerId','Ticket','Cabin','Name'],axis=1,inplace=True)

In [5]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [6]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [7]:
Age_Medians=df.groupby('Embarked')['Age'].median().reset_index()

In [8]:
Age_Medians

  Embarked   Age
0        C  29.0
1        Q  27.0
2        S  28.0

In [9]:
def Imputer(cols):
    Age=cols[0]
    Embarked=cols[1]
    if pd.isnull(Age):
        if Embarked==0:
            return 29
        elif Embarked==1:
            return 27
        else:
            return 28
    else:
        return Age
df['Age']=df[['Age','Embarked']].apply(Imputer,axis=1)

In [10]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    2
dtype: int64

In [11]:
df.dropna(inplace=True)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 889 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  889 non-null    int64
 1   Pclass    889 non-null    int64
 2   Sex       889 non-null    object
 3   Age       889 non-null    float64
 4   SibSp     889 non-null    int64
 5   Parch     889 non-null    int64
 6   Fare      889 non-null    float64
 7   Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 62.5+ KB

In [13]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [14]:
x=df[['Pclass','Age','SibSp','Parch','Fare','Sex','Embarked']]
y=df['Survived']

In [15]:
x['Embarked']=x.Embarked.map({'C': 0, 'Q': 1, 'S': 2})

C:\Users\PROFESSOR\AppData\Local\Temp\ipykernel_9904\3707244183.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x['Embarked']=x.Embarked.map({'C': 0, 'Q': 1, 'S': 2})

In [16]:
x

     Pclass   Age  SibSp  Parch     Fare     Sex  Embarked
0         3  22.0      1      0   7.2500    male         2
1         1  38.0      1      0  71.2833  female         0
2         3  26.0      0      0   7.9250  female         2
3         1  35.0      1      0  53.1000  female         2
4         3  35.0      0      0   8.0500    male         2
..      ...   ...    ...    ...      ...     ...       ...
886       2  27.0      0      0  13.0000    male         2
887       1  19.0      0      0  30.0000  female         2
888       3  28.0      1      2  23.4500  female         2
889       1  26.0      0      0  30.0000    male         0
890       3  32.0      0      0   7.7500    male         1

[889 rows x 7 columns]

In [17]:
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder,StandardScaler
ct= ColumnTransformer(
    transformers=[
        ('cat', OneHotEncoder(drop='first'), ['Sex']),# One-hot encode categorical columns
#         ('encode',StandardScaler(),['Pclass','Age','SibSp','Parch','Fare'])
    ],remainder='passthrough')
x=ct.fit_transform(x)

In [18]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=24)

In [19]:
x_train.shape

(711, 7)

In [20]:
from sklearn.linear_model import LogisticRegression
log_reg=LogisticRegression()
log_reg.fit(x_train,y_train)

LogisticRegression()

In [21]:
from sklearn.metrics import accuracy_score
y_pred=log_reg.predict(x_test)
accuracy=round(accuracy_score(y_test,y_pred)*100,2)
accuracy

88.2

In [22]:
import pickle as pk
pk.dump(log_reg,open('model.pkl','wb'))